# 3'. Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество 
# вхождений одной строки в другой.
# Пример :
# абвгдабвгд -> 2
# абв

str_1 = input()
str_2 = input()
print(str_1.count(str_2))