# Напишите программу, которая принимает на вход два числа и проверяет, 
# является ли одно число квадратом другого.

a = int(input())
b = int(input())

if b / a == a:
    print('Является')